Examples/RegionSolvers/thingOnAStick/system/solid/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters   1;

vertices
(
    (0.2 0   0)
    (0.25 0   0)
    (0.35 0   0)
    (0.4 0   0)
    (0.2 0.05 0)
    (0.25 0.05 0)
    (0.35 0.05 0)
    (0.4 0.05 0)
    (0.2 0.1 0)
    (0.25 0.1 0)
    (0.35 0.1 0)
    (0.4 0.1 0)
    (0.2 0   0.02)
    (0.25 0   0.02)
    (0.35 0   0.02)
    (0.4 0   0.02)
    (0.2 0.05 0.02)
    (0.25 0.05 0.02)
    (0.35 0.05 0.02)
    (0.4 0.05 0.02)
    (0.2 0.1 0.02)
    (0.25 0.1 0.02)
    (0.35 0.1 0.02)
    (0.4 0.1 0.02)
);

blocks
(
    hex (0 1 5 4 12 13 17 16) (10 10 1) simpleGrading (1 1 1)
    hex (2 3 7 6 14 15 19 18) (10 10 1) simpleGrading (1 1 1)
    hex (4 5 9 8 16 17 21 20) (10 10 1) simpleGrading (1 1 1)
    hex (5 6 10 9 17 18 22 21) (20 10 1) simpleGrading (1 1 1)
    hex (6 7 11 10 18 19 23 22) (10 10 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    auszen {
        type mappedWall;
        faces (
            (8 20 21 9)
            (9 21 22 10)
            (10 22 23 11)
            (0 12 16 4)
            (4 16 20 8)
            (11 23 19 7)
            (7 19 15 3)
        );
        sampleMode      nearestPatchFace;
        sampleRegion    region0;
        samplePatch     obstacle;
    }
    frontAndBack {
        type empty;
        faces (
            (0 4 5 1)
            (12 13 17 16)
            (2 6 7 3)
            (14 15 19 18)
            (4 8 9 5)
            (16 17 21 20)
            (5 9 10 6)
            (17 18 22 21)
            (6 10 11 7)
            (18 19 23 22)
        );
    }
    innen {
        type patch;
        faces (
            (5 17 13 1)
            (6 18 17 5)
            (2 14 18 6)
        );
    }
    mitte {
        type symmetryPlane;
        faces (
            (1 13 12 0)
            (3 15 14 2)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
