Examples/RegionSolvers/thingOnAStick/constant/solid/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/solid/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    auszen
    {
        type            mappedWall;
        inGroups        2(wall mappedPatch);
        nFaces          80;
        startFace       1130;
        sampleMode      nearestPatchFace;
        sampleRegion    region0;
        samplePatch     obstacle;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          1200;
        startFace       1210;
    }
    innen
    {
        type            patch;
        nFaces          40;
        startFace       2410;
    }
    mitte
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          20;
        startFace       2450;
    }
)

// ************************************************************************* //
